# coding: utf-8

class FillPages < ActiveRecord::Migration
  def up
    execute "INSERT INTO pages VALUES (1,'about_us','О нас','2011-02-06 23:33:50','2011-02-06 23:33:50'),(2,'articles','Статьи','2011-02-06 23:33:51','2011-02-06 23:33:51'),(3,'ritual_venok','Ритуальный венок','2011-02-06 23:33:51','2011-02-06 23:33:51'),(4,'ritual_venok_tradition','Традиция','2011-02-06 23:33:51','2011-02-06 23:33:51'),(5,'symbols','Символы','2011-02-06 23:33:51','2011-02-06 23:33:51'),(6,'reportage','Репортаж','2011-02-06 23:33:52','2011-02-06 23:33:52'),(7,'links','Ссылки','2011-02-06 23:33:52','2011-02-06 23:33:52'),(8,'contacts','Контакты','2011-02-06 23:33:53','2011-02-06 23:33:53'),(9,'forma_venka','Значение формы ритуального венка','2013-02-20 06:52:33','2013-02-20 06:52:33'),(10,'predstavitelstvo-v-peterburge','Представительство в СПб','2013-04-23 07:05:02','2013-04-23 07:05:02')"
    ActiveRecord::Base.connection.reset_pk_sequence!('pages')
  end

  def down
    execute "DELETE FROM pages"
  end
end
